
{"papers":[
      {"title"     : "Anlyzing multivariate data based on a discrete gradient field",
     "day"         : "11",
     "month"       : "10",
     "author"      : "Federico Iuricich",
     "authorpage"  : "https://iuricichf.github.io/my_site/0",
     "abstract"    : "Multivariate data are becoming more and more popular in several applications, including physics, chemistry, medicine, geography, etc. A multivariate dataset is represented by a cell complex and a vector-valued function defined on the complex vertices. The major challenge arising when dealing with multivariate data is to obtain concise and effective visualizations. The usability of common visual elements (e.g., color, shape, size) deteriorates when the number of variables increases. We propose a new algorithm, well suited for parallel and distributed implementations, for computing a discrete gradient field. The latter is used as the basis of a visualization tool for capturing the mutual relationships among the different functions of the dataset.",
     "slides"      : "",
     "keywords"    : "Multivariate data, Discrete Morse theory, visualization"
    },
      {"title"     : "Introduction to the Treemapping project",
     "day"         : "4",
     "month"       : "10",
     "author"      : "Xin Xu",
     "authorpage"  : "https://geog.umd.edu/gradprofile/Xu/Xin%20",
     "abstract"    : "In this talk, I will introduce our progress on the Treemapping project. The aim of the Treemapping project is to derive individual tree information from a point cloud acquired from the Airborne LIDAR (Light Detection and Ranging). Extracting individual tree information and understanding how forest structures evolve is crucial for studies of ecology, biology, etc. The existing methods present severe limitations in identifying under-story trees and overlapping trees in the various types of forests. Here, we describe the idea at the base of our two novel approaches based on topological and geometrical tools.",
     "slides"      : "",
     "keywords"    : "LIDAR, point cloud, topology"
    },
      {"title"     : "A visual analytics platform for exploring urban activity behavior",
     "day"         : "27",
     "month"       : "9",
     "author"      : "Grant McKenzie",
     "authorpage"  : "https://geog.umd.edu/facultyprofile/McKenzie/Grant",
     "abstract"    : "Place-based social sharing applications offer new opportunities to better understand the dynamics of human activity behavior. These application provide access to billions of user location check-ins that promote a better understand of the popularity of places and regions within a city. In this initial work, I introduce a visual analytics platform for exploring the dynamics of place-driven urban activity behavior. This platform allows users to exploit the spatiotemporal resolution of place interactions for a better understanding of the dynamics of the city. Users can compare region popularity between hours of the day or days of the week and the influence of a change in weather on the dynamics of the city.",
     "slides"      : "",
     "keywords"    : "urban data, human behavior, visual analytics"
    },
      {"title"       : "Analysis of geolocalized social networks based on simplicial complexes",
       "day"         : "18",
       "month"       : "9",
       "author"      : "Riccardo Fellegara",
       "authorpage"  : "http://www.umiacs.umd.edu/~ilfelle/",
       "abstract"    : "A common issue in network analysis consists in the detection and characterization of the key vertices and communities.  To this purpose, visualization tools could be of great help to support domain experts in analyzing this kind of data. However, the size of real networks can seriously affect the practical usage of these tools, thus, requiring the definition of suitable simplification procedures that preserve the core network information.  In this work, we focus on geolocalized social networks, and we describe a tool for the analysis of this kind of data based on topological information.  Supported by recent trends in network analysis, our approach uses simplicial complexes as a model for social networks. A homology-preserving simplification is used for dealing with the data complexity and for reducing the information to be visualized to the essential. By combining the representation based on simplicial complexes and the simplification tool, we can efficiently retrieve topological information useful for the network analysis. Both the effectiveness and scalability of our approach are experimentally demonstrated.",
       "slides"      : "",
       "keywords"    : "Network analysis and visualization, geolocalized social networks, homology-preserving simplification, simplicial complexes."
     },
      {"title"       : "Introduction to Topological Data Analysis",
       "day"         : "11",
       "month"       : "9",
       "author"      : "Federico Iuricich",
       "authorpage"  : "https://iuricichf.github.io/my_site/",
       "abstract"    : "Topological Data Analysis (TDA) can be seen as a set of methods that use, as its model of data, only a notion of similarity between data points. Its primary advantage is the generality since any notion of similarity is enough to use the methodology. For the same reason algorithms derived from TDA tend to be very forgiving of small errors and has been revealed to be extremely effective for dealing with noise. At the same time its generality makes TDA a quite challenging topic, especially for those who do not have a strong background in topology. In this talk I will provide an intuitive introduction to TDA, also mentioning applications.",
       "slides"      : "",
       "keywords"    : "TDA, homology, networks, point clouds"
     },
      {"title"      : "Comparing Clustering Algorithms for Graphs",
       "day"         : "7",
       "month"       : "9",
       "author"      : "Olivia Pomerenk",
       "authorpage"  : "",
       "abstract"    : "We are considering a new data structure for encoding a network based only on its maximal cliques and vertices to provide greater efficiency in extracting substructures from a graph (a process which is generally computationally intensive, especially with large networks). The purpose of this summer’s research was to compare various graph clustering algorithms to find the best candidate to be a basis for this new data structure. The ideal algorithm has to work solely based on the community structure of the graph, without any extraneous vertex or edge attributes. The project relies heavily on preexisting literature and algorithms—specifically, algorithms written in the R iGraph library. The algorithms are tested on publicly available networks of increasing size (from hundreds to millions of nodes) and compared based on their space and time complexity, scalability, requisite parameters, homogeneity of the clustering they produce, and the number of edges within and without a cluster. The anticipated outcome of this research is the selection of one algorithm which will provide an ideal decomposition for new data structure.",
       "slides"      : "",
       "keywords"    : "R, graphs, clustering"
    }
  ]
}
